[
  {
    "title": "Lead Front-end / Web Developer",
    "entity": "Maliksi Creative Technologies",
    "id": "maliksi",
    "year_start": "2020",
    "year_end": "2024",
    "month_start": "11",
    "month_end": "11",
    "description": [
      "Architected, designed, and prototyped research, development, and proof-of-concept applications while ensuring the highest quality of code and user experience with accessibility in mind.",
      "Guide and mentor junior developers in technical skills and best practices through code reviews.",
      "Participated in decision-making processes related to product roadmap, feature prioritization, and design guidelines.",
      "Drove the technical vision and development of our flagship product."
    ]
  },
  {
    "title": "Senior Front-end / Web Developer",
    "entity": "GradGuru",
    "id": "gradguru",
    "year_start": "2017",
    "year_end": "2020",
    "month_start": "11",
    "month_end": "11",
    "description": [
      "Developed and maintained front-end components for a multi-app system for its V2 release.",
      "Integrated and customized third-party apps and libraries."
    ]
  },
  {
    "title": "UI/UX Front-end Developer",
    "entity": "[24]7.ai",
    "id": "247ai",
    "year_start": "2015",
    "year_end": "2017",
    "month_start": "07",
    "month_end": "12",
    "description": [
      "Specialized in developing web applications, ranging from client-facing products, internal tools to demos and concept prototypes.",
      "This involved translating design specifications and technical requirements into functional solutions, including UI/UX design, algorithm implementation, and visual interaction."
    ]
  },
  {
    "title": "Freelance Interactive Developer",
    "entity": "jaycsantos.com",
    "id": "jaycsantos",
    "year_start": "2007",
    "year_end": "2014",
    "month_start": "03",
    "month_end": "05",
    "description": [
      "Designed and developed interactive media, including casual games and web applications, focusing on accessibility, user experience, and visual design.",
      "Created engaging digital experiences through casual games and web applications, emphasizing accessibility, user experience, and robust programming."
    ]
  }
]