[
  {
    "title": "Lead Web Developer",
    "entity": "Maliksi Creative Technologies",
    "id": "maliksi",
    "year_start": "2020",
    "year_end": "2024",
    "month_start": "11",
    "month_end": "11",
    "description": [
      "Drove the technical vision and development of flagship product inlcuding product demos and proof-of-concept apps. Ensuring the highest quality of code and user experience with accessibility in mind.",
      "Fostered the growth of junior developers by sharing best practices, constructive feedbacks and code reviews.",
      "Participated in decision-making processes related to product roadmap, feature prioritization, design guidelines, and hiring/interview."
    ]
  },
  {
    "title": "Senior Front-end Developer",
    "entity": "GradGuru (contractor)",
    "id": "gradguru",
    "year_start": "2017",
    "year_end": "2020",
    "month_start": "11",
    "month_end": "11",
    "description": [
      "Engineered and supported front-end components for a multi-app system's V2 release, adhering to best practices and industry standards.",
      "Created a high-performance CSV parser for batch data processing operations.",
      "Seamlessly integrated with backend RESTful APIs, employing JWT-based authentication to guarantee secure and private data exchange"
    ]
  },
  {
    "title": "UI/UX Front-end Developer",
    "entity": "[24]7.ai",
    "id": "247ai",
    "year_start": "2015",
    "year_end": "2017",
    "month_start": "07",
    "month_end": "12",
    "description": [
      "Under shared services department: Specialized in developing web applications, ranging from client-facing products, internal tools to product demos and concept prototypes.",
      "Translated design specifications and technical requirements into functional solutions, including UI/UX design, algorithm implementation, and interactive visual modeling."
    ]
  },
  {
    "title": "Freelance Flash/Web Developer",
    "entity": "jaycsantos.com",
    "id": "jaycsantos",
    "year_start": "2007",
    "year_end": "2014",
    "month_start": "03",
    "month_end": "05",
    "description": [
      "Developed interactive casual flash games, focused on fun experience and visual design. Was able to work with big clients like Sega UK, DisneyXD, and BigFishGames among others.",
      "Collaborated with clients to understand their unique needs and designed and developed custom websites and web applications, such as content management systems and personal websites.",
      "Tailored WordPress templates and plugins, and integrated external RSS feeds and PHP libraries to meet specific client needs.",
      "Created a highly-regarded mod for the Arcadem Pro arcade script, resulting in significant community interest and subsequent commission opportunities."
    ]
  }
]