[
  {
    "title": "Lead Web Developer",
    "entity": "Maliksi Creative Technologies",
    "id": "maliksi",
    "year_start": "2020",
    "year_end": "2024",
    "month_start": "11",
    "month_end": "11",
    "description": [
      "Drove the technical vision and development of the company's flagship app, including other app demos and MVPs.",
      "Participated in key decision-making processes related to product roadmap, feature priority, design guidelines, and hiring/interviews.",
      "Adapted and learned Dart/Flutter to effectively lead in both mobile and web app development. Designing reusable code with streamlined interfaces for minimal integration effort of jr devs and maintainability.",
      "Fostered the growth of junior developers by providing mentorship, performance and code reviews, ensuring the highest quality, scalability, security and reusability of code."
    ]
  },
  {
    "title": "Senior Front-end Developer",
    "entity": "GradGuru (contractor)",
    "id": "gradguru",
    "year_start": "2017",
    "year_end": "2020",
    "month_start": "11",
    "month_end": "11",
    "description": [
      "Engineered and supported front-end components for the v2 release of a multi-app system, including admin console and web chat app, with seamless integrations.",
      "Created a high-performance CSV parser for batch data processing operations, leading to a significant improvement in user experience for those handling bulk data."
    ]
  },
  {
    "title": "UI/UX Front-end Developer",
    "entity": "[24]7.ai",
    "id": "247ai",
    "year_start": "2015",
    "year_end": "2017",
    "month_start": "07",
    "month_end": "12",
    "description": [
      "Within the shared services department, I specialized in developing web applications, ranging from client-facing products and internal tools to product demos and concept prototypes.",
      "Translated design specifications and technical requirements into functional solutions, encompassing UI/UX design, algorithm implementation, and interactive visual modeling."
    ]
  },
  {
    "title": "Freelance Flash/Web Developer",
    "entity": "jaycsantos.com",
    "id": "jaycsantos",
    "year_start": "2007",
    "year_end": "2014",
    "month_start": "03",
    "month_end": "05",
    "description": [
      "Developed interactive casual Flash games with a strong focus on fun gameplay experiences and engaging visual design. Collaborated with prominent clients such as Sega UK, Disney XD, Big Fish Games, and more.",
      "Collaborated with clients to understand their unique needs and designed and developed custom websites and web applications, including content management systems and personal websites.",
      "Customized WordPress templates and plugins, and integrated external libraries & RSS feeds.",
      "Developed a highly-regarded mod for the Arcadem Pro arcade script, garnering significant community interest and leading to subsequent commission opportunities."
    ]
  }
]
